# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\floof\Documents\PSoC Creator\electronics\Design01.cydsn\Design01.cyprj
# Date: Fri, 19 Jul 2024 00:54:36 GMT
#set_units -time ns
create_clock -name {Clock_1(routed)} -period 62500 -waveform {0 31250} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4501 9001} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\Users\floof\Documents\PSoC Creator\electronics\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\floof\Documents\PSoC Creator\electronics\Design01.cydsn\Design01.cyprj
# Date: Fri, 19 Jul 2024 00:54:32 GMT
